<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Case Study: Movie Data Analysis</p>

This notebook uses a dataset from the MovieLens website. We will describe the dataset further as we explore with it using *pandas*. 

###  the Dataset 
- No need to download them, as they have been provided to you.

* **Data Source:** MovieLens web site (filename: ml-20m.zip)
* **Location:** https://grouplens.org/datasets/movielens/

<h1 style="font-size:1.5em;color:#2467C0"> Use `Pandas.read_csv()` to Read the movies.csv Dataset. </h1>

Make sure the relative path is correct.

In [4]:
import pandas as pd

In [5]:
movies = pd.read_csv('movies.csv', sep=',')
print(type(movies))
movies.head(4)

<class 'pandas.core.frame.DataFrame'>

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance

<h1 style="font-size:1.5em;color:#2467C0">DataFrames </h1>

In [7]:
movies.shape

(87585, 3)

In [8]:
movies.columns

Index(['movieId', 'title', 'genres'], dtype='object')

<h1 style="font-size:2em;color:#2467C0">Slicing Out Columns</h1>

In [10]:
movies.title.head() # or movies['title']

0                      Toy Story (1995)
1                        Jumanji (1995)
2               Grumpier Old Men (1995)
3              Waiting to Exhale (1995)
4    Father of the Bride Part II (1995)
Name: title, dtype: object

In [11]:
movies[['title']].head()

                                title
0                    Toy Story (1995)
1                      Jumanji (1995)
2             Grumpier Old Men (1995)
3            Waiting to Exhale (1995)
4  Father of the Bride Part II (1995)

In [12]:
df_id_titles = movies[['movieId','title']] #Note the double '[]'
print(type(df_id_titles))
df_id_titles.head()

<class 'pandas.core.frame.DataFrame'>

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [13]:
#Show only movieId and title
df = movies.iloc[:, :2]
df.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

<h1 style="font-size:2em;color:#2467C0">Slicing Out Rows</h1>

In [15]:
it = movies.iloc[:3] # return a dataframe type
it.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [16]:
#Use a single [ ] also works
movies[-3:]

       movieId                      title                        genres
87582   292753                Orca (2023)                         Drama
87583   292755     The Angry Breed (1968)                         Drama
87584   292757  Race to the Summit (2023)  Action|Adventure|Documentary

<h1 style="font-size:2em;color:#2467C0">Slicing Out both rows and columns</h1>

In [37]:
movies.loc[0:3, ['movieId', 'title']]
#从 行标签 0 到行标签 3 的数据（包含结束标签）
#loc 是基于标签进行索引的，而不是基于位置的。
#因此，0:3 在使用 loc 时是包含结束标签的（即包含行标签为 3 的行）。

   movieId                     title
0        1          Toy Story (1995)
1        2            Jumanji (1995)
2        3   Grumpier Old Men (1995)
3        4  Waiting to Exhale (1995)

In [19]:
movies.iloc[0:2, [0,2]]
#iloc 是基于 位置 来进行索引的，且切片是 不包含结束位置 的

   movieId                                       genres
0        1  Adventure|Animation|Children|Comedy|Fantasy
1        2                   Adventure|Children|Fantasy

In [20]:

movies.iloc[0:2, 0:2]

   movieId             title
0        1  Toy Story (1995)
1        2    Jumanji (1995)

<h1 style="font-size:2em;color:#FF6111">Practice -- Basic DataFrame Operations</h1>

1. show first 4 rows of DataFrame **movies**.
2. show first five movies' `titles` and `genres`.
3. show row 0 and 2.
4. Show the 'title' column of the first 3 rows of DataFrame **movies**
5. Show the `movieId` and `genres` columns of the first 3 rows of DataFrame **movies**. Hints: use loc()